miolabs/ExOS/support/lpc11/cpu.h
#ifndef LPC11_CPU_H
#define LPC11_CPU_H

#include <CMSIS/LPC11xx.h>

#define PRESETCTRL_SSP0_RST_N 0x1
#define PRESETCTRL_I2C_RST_N 0x2
#define PRESETCTRL_SSP1_RST_N 0x4
#define PRESETCTRL_CAN_RST_N 0x8

#define SYSPLLCTRL_MSEL_MASK 0x1F
#define SYSPLLCTRL_MSEL_BIT 0
#define SYSPLLCTRL_PSEL_MASK 0x60
#define SYSPLLCTRL_PSEL_BIT 5

#define SYSPLLSTAT_LOCK 0x1

#define SYSOSCCTRL_BYPASS 0x1
#define SYSOSCCTRL_FREQRANGE 0x2

#define SYSRESSTAT_POR 0x1
#define SYSRESSTAT_EXTRST 0x2
#define SYSRESSTAT_WDT 0x4
#define SYSRESSTAT_BOD 0x8
#define SYSRESSTAT_SYSRST 0x10

#define SYSPLLCLKUEN_ENA 0x1

#define MAINCLKUEN_ENA 0x1

#define SYSAHBCLKCTRL_SYS 0x1
#define SYSAHBCLKCTRL_ROM 0x2
#define SYSAHBCLKCTRL_RAM 0x4
#define SYSAHBCLKCTRL_FLASHREG 0x8
#define SYSAHBCLKCTRL_FLASHARRAY 0x10
#define SYSAHBCLKCTRL_I2C 0x20
#define SYSAHBCLKCTRL_GPIO 0x40
#define SYSAHBCLKCTRL_CT16B0 0x80
#define SYSAHBCLKCTRL_CT16B1 0x100
#define SYSAHBCLKCTRL_CT32B0 0x200
#define SYSAHBCLKCTRL_CT32B1 0x400
#define SYSAHBCLKCTRL_SSP0 0x800
#define SYSAHBCLKCTRL_UART 0x1000
#define SYSAHBCLKCTRL_ADC 0x2000
#define SYSAHBCLKCTRL_WDT 0x8000
#define SYSAHBCLKCTRL_IOCON 0x10000
#define SYSAHBCLKCTRL_CAN 0x20000
#define SYSAHBCLKCTRL_SSP1 0x40000

#define WDTCLKUEN_ENA 0x1

#define CLKOUTUEN_ENA 0x1

#define PIOPORCAP0_CAPPIO0_0 0x1
#define PIOPORCAP0_CAPPIO0_1 0x2
#define PIOPORCAP0_CAPPIO0_2 0x4
#define PIOPORCAP0_CAPPIO0_3 0x8
#define PIOPORCAP0_CAPPIO0_4 0x10
#define PIOPORCAP0_CAPPIO0_5 0x20
#define PIOPORCAP0_CAPPIO0_6 0x40
#define PIOPORCAP0_CAPPIO0_7 0x80
#define PIOPORCAP0_CAPPIO0_8 0x100
#define PIOPORCAP0_CAPPIO0_9 0x200
#define PIOPORCAP0_CAPPIO0_10 0x400
#define PIOPORCAP0_CAPPIO0_11 0x800
#define PIOPORCAP0_CAPPIO1_0 0x1000
#define PIOPORCAP0_CAPPIO1_1 0x2000
#define PIOPORCAP0_CAPPIO1_2 0x4000
#define PIOPORCAP0_CAPPIO1_3 0x8000
#define PIOPORCAP0_CAPPIO1_4 0x10000
#define PIOPORCAP0_CAPPIO1_5 0x20000
#define PIOPORCAP0_CAPPIO1_6 0x40000
#define PIOPORCAP0_CAPPIO1_7 0x80000
#define PIOPORCAP0_CAPPIO1_8 0x100000
#define PIOPORCAP0_CAPPIO1_9 0x200000
#define PIOPORCAP0_CAPPIO1_10 0x400000
#define PIOPORCAP0_CAPPIO1_11 0x800000
#define PIOPORCAP0_CAPPIO2_0 0x1000000
#define PIOPORCAP0_CAPPIO2_1 0x2000000
#define PIOPORCAP0_CAPPIO2_2 0x4000000
#define PIOPORCAP0_CAPPIO2_3 0x8000000
#define PIOPORCAP0_CAPPIO2_4 0x10000000
#define PIOPORCAP0_CAPPIO2_5 0x20000000
#define PIOPORCAP0_CAPPIO2_6 0x40000000
#define PIOPORCAP0_CAPPIO2_7 0x80000000

#define PIOPORCAP1_CAPPIO2_8 0x1
#define PIOPORCAP1_CAPPIO2_9 0x2
#define PIOPORCAP1_CAPPIO2_10 0x4
#define PIOPORCAP1_CAPPIO2_11 0x8
#define PIOPORCAP1_CAPPIO3_0 0x10
#define PIOPORCAP1_CAPPIO3_1 0x20
#define PIOPORCAP1_CAPPIO3_2 0x40
#define PIOPORCAP1_CAPPIO3_3 0x80
#define PIOPORCAP1_CAPPIO3_4 0x100
#define PIOPORCAP1_CAPPIO3_5 0x200

#define BODCTRL_BODRSTLEV_BIT 0
#define BODCTRL_BODINTVAL_BIT 2
#define BODCTRL_BODRSTENA 0x10

#define STARTAPRP0_APRPIO0_0 0x1
#define STARTAPRP0_APRPIO0_1 0x2
#define STARTAPRP0_APRPIO0_2 0x4
#define STARTAPRP0_APRPIO0_3 0x8
#define STARTAPRP0_APRPIO0_4 0x10
#define STARTAPRP0_APRPIO0_5 0x20
#define STARTAPRP0_APRPIO0_6 0x40
#define STARTAPRP0_APRPIO0_7 0x80
#define STARTAPRP0_APRPIO0_8 0x100
#define STARTAPRP0_APRPIO0_9 0x200
#define STARTAPRP0_APRPIO0_10 0x400
#define STARTAPRP0_APRPIO0_11 0x800
#define STARTAPRP0_APRPIO1_0 0x1000

#define STARTERP0_ERPIO0_0 0x1
#define STARTERP0_ERPIO0_1 0x2
#define STARTERP0_ERPIO0_2 0x4
#define STARTERP0_ERPIO0_3 0x8
#define STARTERP0_ERPIO0_4 0x10
#define STARTERP0_ERPIO0_5 0x20
#define STARTERP0_ERPIO0_6 0x40
#define STARTERP0_ERPIO0_7 0x80
#define STARTERP0_ERPIO0_8 0x100
#define STARTERP0_ERPIO0_9 0x200
#define STARTERP0_ERPIO0_10 0x400
#define STARTERP0_ERPIO0_11 0x800
#define STARTERP0_ERPIO1_0 0x1000

#define STARTRSRP0CLR_RSRPIO0_0 0x1
#define STARTRSRP0CLR_RSRPIO0_1 0x2
#define STARTRSRP0CLR_RSRPIO0_2 0x4
#define STARTRSRP0CLR_RSRPIO0_3 0x8
#define STARTRSRP0CLR_RSRPIO0_4 0x10
#define STARTRSRP0CLR_RSRPIO0_5 0x20
#define STARTRSRP0CLR_RSRPIO0_6 0x40
#define STARTRSRP0CLR_RSRPIO0_7 0x80
#define STARTRSRP0CLR_RSRPIO0_8 0x100
#define STARTRSRP0CLR_RSRPIO0_9 0x200
#define STARTRSRP0CLR_RSRPIO0_10 0x400
#define STARTRSRP0CLR_RSRPIO0_11 0x800
#define STARTRSRP0CLR_RSRPIO1_0 0x1000

#define STARTSRP0_SRPIO0_0 0x1
#define STARTSRP0_SRPIO0_1 0x2
#define STARTSRP0_SRPIO0_2 0x4
#define STARTSRP0_SRPIO0_3 0x8
#define STARTSRP0_SRPIO0_4 0x10
#define STARTSRP0_SRPIO0_5 0x20
#define STARTSRP0_SRPIO0_6 0x40
#define STARTSRP0_SRPIO0_7 0x80
#define STARTSRP0_SRPIO0_8 0x100
#define STARTSRP0_SRPIO0_9 0x200
#define STARTSRP0_SRPIO0_10 0x400
#define STARTSRP0_SRPIO0_11 0x800
#define STARTSRP0_SRPIO1_0 0x1000

#define PDSLEEPCFG_IRCOUT_PD 0x1
#define PDSLEEPCFG_IRC_PD 0x2
#define PDSLEEPCFG_FLASH_PD 0x4
#define PDSLEEPCFG_BOD_PD 0x8
#define PDSLEEPCFG_ADC_PD 0x10
#define PDSLEEPCFG_SYSOSC_PD 0x20
#define PDSLEEPCFG_WDTOSC_PD 0x40
#define PDSLEEPCFG_SYSPLL_PD 0x80

#define PDAWAKECFG_IRCOUT_PD 0x1
#define PDAWAKECFG_IRC_PD 0x2
#define PDAWAKECFG_FLASH_PD 0x4
#define PDAWAKECFG_BOD_PD 0x8
#define PDAWAKECFG_ADC_PD 0x10
#define PDAWAKECFG_SYSOSC_PD 0x20
#define PDAWAKECFG_WDTOSC_PD 0x40
#define PDAWAKECFG_SYSPLL_PD 0x80

#define PDRUNCFG_IRCOUT_PD 0x1
#define PDRUNCFG_IRC_PD 0x2
#define PDRUNCFG_FLASH_PD 0x4
#define PDRUNCFG_BOD_PD 0x8
#define PDRUNCFG_ADC_PD 0x10
#define PDRUNCFG_SYSOSC_PD 0x20
#define PDRUNCFG_WDTOSC_PD 0x40
#define PDRUNCFG_SYSPLL_PD 0x80


#endif // LPC11_CPU_H
